#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.base.module.network.data.aws_region.current: Reading...
module.base.module.network.data.aws_region.current: Read complete after 0s [id=ap-southeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.base.module.app_bucket.aws_s3_bucket.app_files will be created
  + resource "aws_s3_bucket" "app_files" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "example-default-app-files"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                    = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.base.module.app_bucket.aws_s3_bucket_acl.app_files_acl will be created
  + resource "aws_s3_bucket_acl" "app_files_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.base.module.app_bucket.aws_s3_bucket_public_access_block.app_files_block will be created
  + resource "aws_s3_bucket_public_access_block" "app_files_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.base.module.app_bucket.aws_s3_bucket_server_side_encryption_configuration.app_files_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "app_files_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.base.module.app_bucket.aws_s3_bucket_versioning.app_files_versioning will be created
  + resource "aws_s3_bucket_versioning" "app_files_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.base.module.database.aws_security_group.db will be created
  + resource "aws_security_group" "db" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Mysql endpoint port"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "example-default-db-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all               = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.base.module.database.aws_ssm_parameter.database_endpoint will be created
  + resource "aws_ssm_parameter" "database_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/wordpress_db_host"
      + overwrite      = true
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.aws_ssm_parameter.database_name will be created
  + resource "aws_ssm_parameter" "database_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/wordpress_db_name"
      + overwrite      = true
      + tags           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.aws_ssm_parameter.database_password will be created
  + resource "aws_ssm_parameter" "database_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/wordpress_db_password"
      + overwrite      = true
      + tags           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.aws_ssm_parameter.database_table_prefix will be created
  + resource "aws_ssm_parameter" "database_table_prefix" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/wordpress_table_prefix"
      + overwrite      = true
      + tags           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.aws_ssm_parameter.database_username will be created
  + resource "aws_ssm_parameter" "database_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/wordpress_db_user"
      + overwrite      = true
      + tags           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.aws_ssm_parameter.site_domain will be created
  + resource "aws_ssm_parameter" "site_domain" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/site_domain"
      + overwrite      = true
      + tags           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.aws_ssm_parameter.wordpress_password will be created
  + resource "aws_ssm_parameter" "wordpress_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/wordpress_password"
      + overwrite      = true
      + tags           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.aws_ssm_parameter.wordpress_username will be created
  + resource "aws_ssm_parameter" "wordpress_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/example/default/wordpress_username"
      + overwrite      = true
      + tags           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.base.module.parameters.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.base.module.parameters.random_password.wp_password will be created
  + resource "random_password" "wp_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.cicd.module.deployment.data.aws_iam_policy_document.codedeploy_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "codedeploy_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "codedeploy.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cicd.module.deployment.data.aws_iam_policy_document.codepipeline_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "codepipeline_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "codebuild.amazonaws.com",
                  + "codepipeline.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cicd.module.deployment.aws_codedeploy_app.wp_app will be created
  + resource "aws_codedeploy_app" "wp_app" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Server"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "example-default"
      + tags                = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all            = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
    }

  # module.cicd.module.deployment.aws_codedeploy_deployment_group.wp_instances will be created
  + resource "aws_codedeploy_deployment_group" "wp_instances" {
      + app_name               = "example-default"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = "CodeDeployDefault.OneAtATime"
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "example-default-group"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags                   = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all               = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout    = (known after apply)
              + wait_time_in_minutes = (known after apply)
            }

          + green_fleet_provisioning_option {
              + action = (known after apply)
            }

          + terminate_blue_instances_on_deployment_success {
              + action                           = (known after apply)
              + termination_wait_time_in_minutes = (known after apply)
            }
        }

      + ec2_tag_set {
          + ec2_tag_filter {
              + key   = "Name"
              + type  = "KEY_AND_VALUE"
              + value = "example-default"
            }
        }
    }

  # module.cicd.module.deployment.aws_codepipeline.wp_pipeline will be created
  + resource "aws_codepipeline" "wp_pipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "example-default-pipeline"
      + role_arn = (known after apply)
      + tags     = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }

      + artifact_store {
          + location = "example-default-app-files"
          + region   = (known after apply)
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "BranchName"       = "develop"
                  + "ConnectionArn"    = ""
                  + "DetectChanges"    = "false"
                  + "FullRepositoryId" = ""
                }
              + name             = "Source"
              + namespace        = "SourceVariables"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeStarSourceConnection"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category         = "Deploy"
              + configuration    = {
                  + "ApplicationName"     = "example-default"
                  + "DeploymentGroupName" = "example-default-group"
                }
              + input_artifacts  = [
                  + "source_output",
                ]
              + name             = "Deploy"
              + output_artifacts = []
              + owner            = "AWS"
              + provider         = "CodeDeploy"
              + region           = (known after apply)
              + run_order        = 1
              + version          = "1"
            }
        }
    }

  # module.cicd.module.deployment.aws_iam_role.codedeploy will be created
  + resource "aws_iam_role" "codedeploy" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "example-default-codedeploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all              = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cicd.module.deployment.aws_iam_role.codepipeline will be created
  + resource "aws_iam_role" "codepipeline" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "example-default-codepipeline-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all              = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "codepipeline-policies"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "codestar-connections:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624743429276"
                        },
                      + {
                          + Action   = "codecommit:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624743453790"
                        },
                      + {
                          + Action   = "codedeploy:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624743459135"
                        },
                      + {
                          + Action   = "ec2:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624751878368"
                        },
                      + {
                          + Action   = "codepipeline:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624743464417"
                        },
                      + {
                          + Action   = "s3:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624744591712"
                        },
                      + {
                          + Action   = "codebuild:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624745010573"
                        },
                      + {
                          + Action   = "logs:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "Stmt1624754937261"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.cicd.module.deployment.aws_iam_role_policy_attachment.codedeploy_service will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_service" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "example-default-codedeploy-role"
    }

  # module.website.module.dns.data.aws_route53_zone.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "this" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "example.com"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.website.module.dns.aws_route53_record.ipv4 will be created
  + resource "aws_route53_record" "ipv4" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "example.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.website.module.dns.aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + records         = [
          + "example.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.website.module.server.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.website.module.server.data.aws_eip.wordpress_eip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eip" "wordpress_eip" {
      + association_id             = (known after apply)
      + carrier_ip                 = (known after apply)
      + customer_owned_ip          = (known after apply)
      + customer_owned_ipv4_pool   = (known after apply)
      + domain                     = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + network_interface_id       = (known after apply)
      + network_interface_owner_id = (known after apply)
      + private_dns                = (known after apply)
      + private_ip                 = (known after apply)
      + public_dns                 = (known after apply)
      + public_ip                  = "52.63.13.191"
      + public_ipv4_pool           = (known after apply)
      + tags                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.website.module.server.data.aws_iam_policy_document.ec2_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "ec2.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.website.module.server.aws_eip_association.wordpress_eip_association will be created
  + resource "aws_eip_association" "wordpress_eip_association" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.website.module.server.aws_iam_instance_profile.wp_ec2 will be created
  + resource "aws_iam_instance_profile" "wp_ec2" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "example-default-instance-profile"
      + path        = "/"
      + role        = "example-default-ec2-role"
      + tags        = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all    = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + unique_id   = (known after apply)
    }

  # module.website.module.server.aws_iam_role.wp_ec2 will be created
  + resource "aws_iam_role" "wp_ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "example-default-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all              = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.website.module.server.aws_iam_role_policy_attachment.wp_ec2_policy_s3 will be created
  + resource "aws_iam_role_policy_attachment" "wp_ec2_policy_s3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "example-default-ec2-role"
    }

  # module.website.module.server.aws_iam_role_policy_attachment.wp_ec2_policy_ssm will be created
  + resource "aws_iam_role_policy_attachment" "wp_ec2_policy_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = "example-default-ec2-role"
    }

  # module.website.module.server.aws_instance.wp_ec2 will be created
  + resource "aws_instance" "wp_ec2" {
      + ami                                  = "ami-02a66f06b3557a897"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "example-default-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                             = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = "enabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = (known after apply)
        }
    }

  # module.website.module.server.aws_security_group.ec2 will be created
  + resource "aws_security_group" "ec2" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "example-default-ec2-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all               = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for example-default-vpc"
      + id                      = (known after apply)
      + name                    = "example-default-vpc"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
    }

  # module.base.module.network.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id   = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route.database_internet_gateway[0] will be created
  + resource "aws_route" "database_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.base.module.network.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.base.module.network.module.vpc.aws_route_table.database[0] will be created
  + resource "aws_route_table" "database" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all         = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id           = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all         = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id           = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all         = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id           = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all         = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id           = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.128/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                                       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.160/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                                       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                                       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                                       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                                       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.96/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                                       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.base.module.network.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                             = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
    }

  # module.website.module.load_balancer.module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "example-default-alb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                   = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.website.module.load_balancer.module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all          = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.website.module.load_balancer.module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "wp-"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "wp-"
        }
      + tags_all                           = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "wp-"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # module.website.module.load_balancer.module.alb.aws_lb_target_group_attachment.this["0.ec2_wp_target"] will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.base.module.database.module.wp_database.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "monitoring.rds.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.base.module.database.module.wp_database.module.db_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.base.module.database.module.wp_database.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = true
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_window                         = "13:00-15:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "wordpress"
      + db_subnet_group_name                  = "example-default-vpc"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.28"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "example-default"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "sat:15:00-sat:17:00"
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                              = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + timezone                              = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.base.module.database.module.wp_database.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = (known after apply)
      + name_prefix              = "example-default-"
      + option_group_description = "example-default option group"
      + tags                     = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all                 = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }

      + timeouts {}
    }

  # module.base.module.database.module.wp_database.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "example-default parameter group"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "example-default-"
      + tags        = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
      + tags_all    = {
          + "Application" = "example"
          + "Environment" = "default"
          + "Name"        = "example-default"
        }
    }

Plan: 59 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_files_bucket = "example-default-app-files"
  + db_endpoint      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Workflow: `Terraform Check`*